//Напишите функцию, которая делает первый символ строки заглавным (задание со звездочкой - капитализируйте каждое слово)
function capitalize(str) {}

//Напишите функцию, которая вернет строку, усеченную до n символов и добавляет в конец многоточие (если n > длина строки - ничего делать не надо)
function truncate(str, n) {}

//Определите, пуст ли объект
function isEmpty(obj) {}

//Напишите функцию, умножающую численные свойства на 2
function multiply(obj) {}

//Напишите функцию, считающую сумму всех элементов массива (желательно использовать reduce)
function sumArr(arr) {}

//Напишите функцию, определяющую, является ли данное слово палиндромом
function isPali(str) {}

module.exports = {
  capitalize,
  truncate,
  isEmpty,
  multiply,
  sumArr,
  isPali
};
