// Напишите класс геометрической точки, принимающей в конструкторе координаты X и Y
// Со звездочкой: реализовать метод, который возвращает расстояние от точки до центра координат (0, 0)
class Point {}

// Напишите класс геометрической точки в трехмерном пространстве (x, y, z),
// который будет наследоваться от точки в двумерном пространстве
class Point3D extends Point {}

// Напишите класс "очередь", в котором можно добавить элемент в конец и получить из начала
class Queue {}

module.exports = {
    Point,
    Point3D,
    Queue,
};
